benchmark_report/wrk_results_25901/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.49ms  151.36ms   1.36s    96.64%
    Req/Sec   701.27     58.14     0.86k    82.36%
  Latency Distribution
     50%   11.34ms
     75%   12.56ms
     90%   13.89ms
     99%    1.02s 
  252809 requests in 31.44s, 23.15MB read
Requests/sec:   8040.22
Transfer/sec:    753.77KB