benchmark_report/wrk_results_25901/wrk_200concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.78ms  281.07ms   2.00s    86.11%
    Req/Sec   709.08    136.34     1.11k    69.28%
  Latency Distribution
     50%   15.99ms
     75%   19.09ms
     90%  604.98ms
     99%    1.04s 
  255021 requests in 30.99s, 23.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 72
Requests/sec:   8230.00
Transfer/sec:    771.56KB