benchmark_report/wrk_results_25901/wrk_400concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   191.63ms  318.34ms   1.91s    82.55%
    Req/Sec   668.97    189.07     1.33k    69.15%
  Latency Distribution
     50%   17.44ms
     75%  245.08ms
     90%  772.10ms
     99%    1.15s 
  241120 requests in 31.12s, 22.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 1022
Requests/sec:   7747.47
Transfer/sec:    726.33KB