benchmark_report/wrk_results_25901/wrk_600concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 600 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   189.02ms  324.02ms   1.91s    83.20%
    Req/Sec   643.53    200.67     1.81k    70.12%
  Latency Distribution
     50%   17.90ms
     75%  221.57ms
     90%  779.21ms
     99%    1.22s 
  231702 requests in 31.10s, 21.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 2230
Requests/sec:   7451.14
Transfer/sec:    698.54KB