benchmark_report/wrk_results_25901/wrk_800concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   186.01ms  330.23ms   1.91s    84.15%
    Req/Sec   659.27    233.15     2.67k    74.25%
  Latency Distribution
     50%   17.36ms
     75%  194.50ms
     90%  785.35ms
     99%    1.25s 
  237642 requests in 31.21s, 21.76MB read
  Socket errors: connect 0, read 0, write 0, timeout 3057
Requests/sec:   7615.33
Transfer/sec:    713.94KB